---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorSeparator
source: html/360f9362-1069-16bd-2587-86ad8a3bbf24.htm
---
# Autodesk.Revit.DB.Plumbing.PipeSettings.ConnectorSeparator Property

The connector separator string.

## Syntax (C#)
```csharp
public string ConnectorSeparator { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null